{
  "backend/main.mo": "Empty Motoko actor definition.",
  "feature_evidence.json": "Feature evidence report describing a new large Take Quiz button on the landing page and its associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including components, utilities, and styles.",
  "frontend/index.css": "Global Tailwind base layer defining extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component toggling between landing and quiz views via local state.",
  "frontend/src/components/DailyCheckIn.tsx": "Daily wellness check-in component with sliders, score calculation, tips, and results display.",
  "frontend/src/components/FooterAttribution.tsx": "Footer component showing fixed team attribution text.",
  "frontend/src/components/PhysioTrackLanding.tsx": "Landing page with header, hero, CTA buttons, feature sections, and scroll-triggered daily check‑in reveal.",
  "frontend/src/components/QuizPage.tsx": "Quiz page generating random questions, collecting answers, scoring results, and showing tips and restart controls.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing an authenticated or anonymous backend actor with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently empty.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/lib/quiz.ts": "Contains quiz question data and utilities for selecting random questions, scoring answers, and generating tips.",
  "frontend/src/lib/scoring.ts": "Implements health score calculation and generates personalized wellness tips based on daily check‑in data.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom themes, typography, animations, and plugin setups.",
  "project_state.json": "Stores project metadata, feature states, and pending requests for the 'Take Quiz' button enhancement."
}